---
kind: other
id: Methods.T:Autodesk.Revit.DB.ConnectionValidationWarning
source: html/ecd3d8f8-b4b0-1a0f-90f3-72d2a2633652.htm
---
# ConnectionValidationWarning Methods

Get ElementIds of affected parts.